app/Livewire/Residential/Week.php

    public function confirmService($id): void
    {
        //TODO: implementar logica para confirmar serviço
//        sleep(3);
        $curentService = Service::find($id);
        $confirm = !$curentService->confirmed;

        $curentService->confirmed = !$curentService->confirmed;
//        dd($curentService);
        $curentService->save();
---
select * from `services` where `services`.`id` = 127240 and `services`.`deleted_at` is null limit 1
update `services` set `confirmed` = 1, `services`.`updated_at` = '2025-02-13 15:01:18' where `id` = 127240

    public function populateModal($id): void
    {
//        sleep(2);
        $currentService = Service::with('customer','employee','control')->find($id);
---
select * from `customers` where `customers`.`id` in (108) and `customers`.`deleted_at` is null
select * from `employees` where `employees`.`id` in (55) and `employees`.`deleted_at` is null
select * from `services` where `services`.`id` = 127240 and `services`.`deleted_at` is null limit 1