app/Helpers/Funcs.php

select * from `configs` where (`user_id` = 1) limit 1
---
    public static function getConfig(): config
    {
     return Config::firstOrCreate(
             ['user_id' => Auth::user()->id],
             ['nun_reg_pages'=> 15,
                    'theme' => 'light',
                    'spots' => 11

             ]
             );