app/Http/Controllers/PdfController.php

select * from `customers` where `customers`.`id` in (108, 115, 134, 209, 483, 712, 717, 813, 906, 988, 1415, 1416, 1553, 1554, 1821, 1828, 1882, 1935, 2001, 2102, 2117, 2203, 2206, 2471, 2499, 2518, 2625, 2660, 2733, 2743, 2751, 2760) and `customers`.`deleted_at` is null
select * from `employees` where `employees`.`id` in (34, 55, 122, 300, 355, 374, 383, 393, 394, 395, 397, 398, 400) and `employees`.`deleted_at` is null
select `services`.*, `customers`.`name` as `customer_name`, `employees`.`name` as `employee_name` from `services` inner join `customers` on `services`.`customer_id` = `customers`.`id` inner join `employees` on `services`.`employee1_id` = `employees`.`id` where `service_date` between '2025-02-10' and '2025-02-15' and `services`.`deleted_at` is null order by `service_date` asc
---
    public function generatePDF($from = null,$till=null)
    {
        $from = $from ?? now()->startOfWeek(Carbon::MONDAY)->format('Y-m-d');
        $till = $till ?? now()->endOfWeek(Carbon::SUNDAY)->format('Y-m-d');

        $services = Service::select('services.*','customers.name as customer_name','employees.name as employee_name'
        )->with('customer','employee','control')
            ->join('customers','services.customer_id','=','customers.id')
            ->join('employees','services.employee1_id','=','employees.id')
            ->whereBetween('service_date',[$from,$till])
            ->orderBY('service_date','asc')
            ->get();