app/Http/Controllers/PopulateController.php

select * from `employees` where `type` = 'RESIDENTIAL' and `employees`.`deleted_at` is null order by `name` asc
---
    public function employee_filter($type = 'RESIDENTIAL', $orderBy = 'name',int $NunOfPages = 0, $short = true){
        if ($NunOfPages <= 0){
            if($short){
                return $this->employee->select(['id','name'])->where('type','=',strtoupper($type))->orderBy($orderBy)->get();
            }else{
                return $this->employee->where('type','=',strtoupper($type))->orderBy($orderBy)->get();