app/Models/Employee.php

    public function servicesFromWeekNumber(int $emp_id,int $weekNun, $year = 'current') :array{
        $date = new DateTreatment();
       $arr_result = [];
       $weekArr = $date->getWeekByNumberWeek($weekNun,$year);
        foreach ($weekArr as $key =>  $weekday){
            $weekdayCarbon = Carbon::create($weekday);
            $arr_result[$key] = DB::table('services')
                ->where('services.employee1_id','=',$emp_id)
                ->where('employees.type','=','RESIDENTIAL')
                ->where('service_date','>=',$weekdayCarbon->startOfDay()->format('Y-m-d H:i:s') )
                ->where('service_date','<=',$weekdayCarbon->endOfDay()->format('Y-m-d H:i:s') )
                ->whereNull('services.deleted_at')
                ->join('employees', 'services.employee1_id','=','employees.id')
                ->join('customers','services.customer_id','=', 'customers.id')
                ->orderBy('service_date')
                ->select(
            'services.id as service_id',
                    'customer_id as cust_id',
                    'employee1_id as emp_id',
                    'service_date',
                    'period',
                    'notes',
                    'who_saved',
                    'confirmed',
                    'fee',
                    'finance_notes',
                    'customers.name as cust_name',
                    'customers.type as cust_type',
                    'employees.name as emp_name'
                )->get()->toArray();
---
select `services`.`id` as `service_id`, `customer_id` as `cust_id`, `employee1_id` as `emp_id`, `service_date`, `period`, `notes`, `who_saved`, `confirmed`, `fee`, `finance_notes`, `customers`.`name` as `cust_name`, `customers`.`type` as `cust_type`, `employees`.`name` as `emp_name` from `services` inner join `employees` on `services`.`employee1_id` = `employees`.`id` inner join `customers` on `services`.`customer_id` = `customers`.`id` where `services`.`employee1_id` = 312 and `employees`.`type` = 'RESIDENTIAL' and date(`service_date`) = '2025-02-10 00:00:00' and `services`.`deleted_at` is null order by `service_date` asc